src/Enums/FileTextExtractionStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>FileTextExtractionStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NotExtracted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Extracted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExtractFailed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/FileStorageTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>FileStorageTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Infobase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VolumesOnHardDisk</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/FileVersions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>FileVersions</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Files</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDateUniversal</Name>
					<Comment>File modification date - converted to Greenwich (without summer and time zone offsets)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Comment>Comment for versions</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VersionNo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Size</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Extension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentalVersion</Name>
					<Comment>Parent version for current version - tree structure of versions is possible</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextExtractionStatus</Name>
					<Comment>Text extraction status - for a background job of text extraction</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.FileTextExtractionStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileStorageType</Name>
					<Comment>Where files are stored - in database as ValueStorage or in directory on drive</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.FileStorageTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Volume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileStorage</Name>
					<Comment>File Versions</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/FileFunctions/Ext/Module.bsl
// Extracts text from files on disk
Procedure TextExtraction() Export
	
	ServerPlatformType = FileOperationsSecondUse.ServerPlatformType();
	If ServerPlatformType <> PlatformType.Windows_x86 And ServerPlatformType <> PlatformType.Windows_x86_64 Then
		Return;  // text extraction works only in Windows
	EndIf;	
	
	NameWithFileExtention = "";	
	
	Try	
		WriteLogEvent("Text extraction", 
			EventLogLevel.Information, , ,
			NStr("en = 'Scheduled texts extraction started'"));
			
		Query = New Query;
		
		Query.Text = 			
		 "SELECT TOP 100
		 |	FileVersions.Ref AS Ref,
		 |	FileVersions.TextExtractionStatus AS TextExtractionStatus,
		 |	FileVersions.FileStorageType AS FileStorageType
		 |FROM
		 |	Catalog.FileVersions AS FileVersions
		 |WHERE
		 |	(FileVersions.TextExtractionStatus = &Status
		 |			OR FileVersions.TextExtractionStatus = VALUE(Enum.FileTextExtractionStatuses.EmptyRef))
		 |	AND FileVersions.Encrypted = &Encrypted";
		
		Query.SetParameter("Status", Enums.FileTextExtractionStatuses.NotExtracted);
		Query.SetParameter("Encrypted", False);
		
		Result = Query.Execute();
		UnloadTable = Result.Unload();
		
		For Each String In UnloadTable Do
			CurrentVersion = String.Ref.GetObject();
			
			NameWithFileExtention = CurrentVersion.Details  + "." + CurrentVersion.Extension;
			
			FileNameWithPath = "";
			FileStorageType = String.FileStorageType;
			
			Try
			
				If FileStorageType = Enums.FileStorageTypes.Infobase Then
					FileBinaryData = CurrentVersion.FileStorage.Get();
					
					FileNameWithPath = GetTempFileName(CurrentVersion.Extension);
					// Save file from infobase to a disk
					FileBinaryData.Write(FileNameWithPath);
				Else // here file on disk
					
					If Not CurrentVersion.Volume.IsEmpty() Then
						FileNameWithPath = FileOperations.VolumeFullPath(CurrentVersion.Volume) + CurrentVersion.FilePath; 
					EndIf;
					
				EndIf;
				
				
				Text = "";
				
				If FileNameWithPath <> "" Then
					// Extracting text from file
					Extraction = New TextExtraction(FileNameWithPath);
					Text = Extraction.GetText();
					CurrentVersion.TextExtractionStatus = Enums.FileTextExtractionStatuses.Extracted;
				EndIf;
			
			Except // Write nothing - it's normal - when nobody can extract Text
				CurrentVersion.TextExtractionStatus = Enums.FileTextExtractionStatuses.ExtractFailed;
			EndTry;
			
			If FileStorageType = Enums.FileStorageTypes.Infobase Then
				DeleteFiles(FileNameWithPath);
			EndIf;

			CurrentVersion.TextStorage = New ValueStorage(Text, New Deflation);

			FileIsLocked = False;
			
			File = CurrentVersion.Owner;
			If File.CurrentVersion = String.Ref Then
				Try
					LockDataForEdit(File);
					FileIsLocked = True;
				Except
					Continue; // output nothing to a user, process next object FileVersions
				EndTry;
			EndIf;
			
			SetPrivilegedMode(True);
			BeginTransaction();
			Try
				CurrentVersion.Write();

				If File.CurrentVersion = String.Ref Then
					FileObject 				= File.GetObject();
					FileObject.TextStorage 	= CurrentVersion.TextStorage;
					FileObject.Write();
				EndIf;
				
				CommitTransaction();
				SetPrivilegedMode(False);
				
				If FileIsLocked Then
					UnlockDataForEdit(File);
				EndIf;
				
			Except
				RollbackTransaction();
				SetPrivilegedMode(False);
				
				If FileIsLocked Then
					UnlockDataForEdit(File);
				EndIf;
				
				Raise;
			EndTry;
			
		EndDo;
		
		WriteLogEvent("Text extraction", 
			EventLogLevel.Information, , ,
			NStr("en = 'Scheduled texts extraction completed'"));
	Except

		ErrorDescriptionInfo = ErrorDescription();
		MessageText = StringFunctionsClientServer.SubstitureParametersInString(
								 NStr("en = 'Unknown error occurred during scheduled texts extraction from file %1'"), 
								 NameWithFileExtention);
		MessageText = MessageText + String(ErrorDescriptionInfo);
		
		WriteLogEvent("Text extraction", 
			EventLogLevel.Error, , ,
			MessageText);
			
	EndTry;
EndProcedure
